Reports/КарточкаДолжника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>КарточкаДолжника</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ДанныеДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ДанныеДоговоров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоЗадолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныйОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неустойка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Контакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Контакт</Name>
			<BasedOn>
				<xr:Item>Document.Планирование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Контакты</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>AccumulationRegister.КонтактыДокументы</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтветственный</xr:Item>
				<xr:Item>AccumulationRegister.ПланВыездов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНеплатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныНеплатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Планирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Планирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделатьСтатусОсновным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсуществитьВыезд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Телефоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗвонка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Адреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Адреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Адреса</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Должники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПодтверждениеДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРегиона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРайона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНаселенногоПункта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУлицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКорпусаСтроения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпусСтроение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдмОкруг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/КарточкаДолжника/Ext/ObjectModule.bsl
Процедура КарточкаДолжника(ТабДок, Должник, Очищать = 1) Экспорт
	Перем ДатаАктуальности;
	
	ДатаАктуальности = ТекущаяДата();
	
	Макет = ЭтотОбъект.ПолучитьМакет("КарточкаДолжника");
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ТекущийОсновнойДолг) КАК ТекущийОсновнойДолг,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ВсегоЗадолженность) КАК ВсегоЗадолженность,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ПросроченныеПроценты) КАК ПросроченныеПроценты,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ПросроченныйОсновнойДолг) КАК ПросроченныйОсновнойДолг,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.Неустойка) КАК Неустойка,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ДнейПросрочки) КАК ДнейПросрочки,
	               	|	ДанныеДоговоровСрезПоследних.ДатаРасчетаЗадолженности КАК ДатаРасчетаЗадолженности,
	               	|	ДанныеДоговоровСрезПоследних.Договор.Ссылка КАК Договор,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ТекущиеПроценты) КАК ТекущиеПроценты,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.Госпошлина) КАК Госпошлина,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.Прочее) КАК Прочее
	               	|ИЗ
	               	|	РегистрСведений.ДанныеДоговоров.СрезПоследних(&Момент, Договор.Владелец = &Должник) КАК ДанныеДоговоровСрезПоследних
	               	|
	               	|СГРУППИРОВАТЬ ПО
	               	|	ДанныеДоговоровСрезПоследних.Договор,
	               	|	ДанныеДоговоровСрезПоследних.ДатаРасчетаЗадолженности,
	               	|	ДанныеДоговоровСрезПоследних.Договор.Ссылка";
	
	Запрос.УстановитьПараметр("Момент",  ДатаАктуальности);
	Запрос.УстановитьПараметр("Должник", Должник);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьТелефоны			= Макет.ПолучитьОбласть("Телефоны");
	ОбластьТелефон			= Макет.ПолучитьОбласть("Телефон");
	ОбластьАдреса			= Макет.ПолучитьОбласть("Адреса");
	ОбластьАдрес			= Макет.ПолучитьОбласть("Адрес");
	ОбластьДоговор			= Макет.ПолучитьОбласть("Договор");
	ОбластьКонтакты			= Макет.ПолучитьОбласть("Контакты");
	ОбластьКонтакт			= Макет.ПолучитьОбласть("Контакт");
	ОбластьДопДанные		= Макет.ПолучитьОбласть("ДопДанные"); 
	
	Если Очищать = 1 Тогда
		ТабДок.Очистить();
	КонецЕсли;
	
	ОбластьШапка.Параметры["ФИО"] = Должник.Наименование;
	
	ТабДок.Вывести(ОбластьШапка);
	
	МестоРаботы = "";
	ДополнительныеДанные = Справочники.ДополнительныеДанные.Выбрать(, Должник.Ссылка);
	Пока ДополнительныеДанные.Следующий() = 1 Цикл
		Если ДополнительныеДанные.Реквизит.Пустая() = 0 Тогда
			Если СокрЛП(ДополнительныеДанные.Реквизит.Наименование)  = "Место работы (наименование организации)" Тогда
				МестоРаботы = СокрЛП(ДополнительныеДанные.Наименование);
				Прервать;
			КонецЕсли
		КонецЕсли
	КонецЦикла;
	
	ОбластьДопДанные.Параметры["ГодРождения"] = Формат(Должник.ДатаРождения, "ДЛФ=ДД"); 
	ОбластьДопДанные.Параметры["ПаспортныеДанные"] = СокрЛП(Должник.НомерПаспорта);
	ОбластьДопДанные.Параметры["МестоРаботы"] = МестоРаботы;
	
	ТабДок.Вывести(ОбластьДопДанные);
	
	// Телефоны
	ТабДок.Вывести(ОбластьТелефоны);
	Телефоны = Справочники.Телефоны.Выбрать(, Должник.Ссылка);
	Пока Телефоны.Следующий() Цикл
		ОбластьТелефон.Параметры["НомерТелефона"] = Телефоны.Наименование;
		ТабДок.Вывести(ОбластьТелефон);
	КонецЦикла;  
	
	// Адреса
	ТабДок.Вывести(ОбластьАдреса);
	Адреса = Справочники.Адреса.Выбрать(, Должник.Ссылка);
	Пока Адреса.Следующий() Цикл
		ОбластьАдрес.Параметры["Адрес"] = Адреса.Наименование;
		ОбластьАдрес.Параметры["ТипАдреса"] = Адреса.Тип;
		ТабДок.Вывести(ОбластьАдрес);
	КонецЦикла;  
	
	// Договор
	Для каждого СтрокаДоговоры Из Результат Цикл
		ОбластьДоговор.Параметры.Заполнить(СтрокаДоговоры);
		ОбластьДоговор.Параметры["ДатаАктуальности"] 			= ДатаАктуальности;
		спрДоговор=СтрокаДоговоры.Договор.ПолучитьОбъект();
		ОбластьДоговор.Параметры["НомерДоговора"]= спрДоговор.НомерДоговора;
		ОбластьДоговор.Параметры["ДатаФинансирования"]= спрДоговор.ДатаФинансирования;
		ОбластьДоговор.Параметры["Банк"]= спрДоговор.Банк;
		
		  
		
		
		ТабДок.Вывести(ОбластьДоговор);
	КонецЦикла; 
	
	// Контакты
	Отбор = Новый Структура("Должник", Должник.Ссылка);
	
	ТабДок.Вывести(ОбластьКонтакты);
	Контакты = Документы.Контакт.Выбрать(,,Отбор);
	Пока Контакты.Следующий() Цикл
		ОбластьКонтакт.Параметры["ОписаниеКонтакта"] 	= Строка(Контакты.Дата) + ", " + Строка(Контакты.ТипКонтакта) + ", причина неплатежа: " + Строка(Контакты.ПричинаНеплатежа);
		ОбластьКонтакт.Параметры["Комментарий"] 		= Контакты.Комментарий;
		ТабДок.Вывести(ОбластьКонтакт);
	КонецЦикла;  
	
КонецПроцедуры
